; domain
;; Shakey world (domain)
;; Assumes that there is only one robot and that all adjacent rooms have a (narrow) door between them.

(define (domain shakey)
	(:requirements :strips :adl :typing)
	(:types 
		location-t ; rooms
		robot-t    ; shakey
		object-t   ; small objects
		box-t      ; boxes
		gripper-t  ; grippers
		switch-t   ; light switches
	)
	(:predicates
		(in ?what ?where)
		(adj ?r-1 ?r-2 - location-t)
		(holding ?gripper - gripper-t ?what - object-t)
		(wide-door ?r-1 ?r-2 - location-t)
		(lights-on ?r - location-t)
		(empty ?gripper - gripper-t)
	)

	(:action move
		:parameters (?who - robot-t ?from ?to - location-t)
		:precondition (and (in ?who ?from)
				   (adj ?from ?to)
				)
		:effect (and (not (in ?who ?from)) (in ?who ?to))
	)

	(:action move-box
		:parameters (?box - box-t ?robot - robot-t ?from ?to - location-t)
		:precondition (and (in ?robot ?from)
				   (in ?box ?from)
				   (adj ?from ?to)
				   (wide-door ?from ?to)
			      )
		:effect (and (not (in ?robot ?from)) (in ?robot ?to)
			     (not (in ?box ?from)) (in ?box ?to)
			)
	)

	(:action turn-on-light
		:parameters (?box - box-t ?robot - robot-t ?switch - switch-t ?room - location-t)
		:precondition (and (in ?robot ?room)
				   (in ?box ?room)
				   (in ?switch ?room)
			      )
		:effect (lights-on ?room)
	)

	(:action turn-off-light
		:parameters (?box - box-t ?robot - robot-t ?switch - switch-t ?room - location-t)
		:precondition (and (in ?robot ?room)
				   (in ?box ?room)
				   (in ?switch ?room)
			      )
		:effect (not (lights-on ?room))
	)

	(:action pick-up
		:parameters (?robot - robot-t ?gripper - gripper-t ?room - location-t ?obj - object-t)
		:precondition (and (in ?robot ?room)
				   (in ?obj ?room)
				   (lights-on ?room)
				   (empty ?gripper)
				)

		:effect (and (holding ?gripper ?obj) (not (in ?obj ?room)) (not (empty ?gripper)))

	)

	(:action drop
		:parameters (?robot - robot-t ?gripper - gripper-t ?room - location-t ?obj - object-t)
		:precondition (and (holding ?gripper ?obj)
				   (in ?robot ?room)
				)

		:effect (and (not (holding ?gripper ?obj)) (in ?obj ?room) (empty ?gripper))

	)
)

; problem
;; Shakey (problem)

(define (problem shakey-1)
	(:domain shakey)
	(:objects
		room-1 room-2 room-3       - location-t
		box                        - box-t 
		robot                      - robot-t
		switch-1 switch-2 switch-3 - switch-t
		gripper-1 gripper-2        - gripper-t
		ball-1 ball-2 ball-3       - object-t
	)

	(:init 
		(adj room-1 room-2)
		(adj room-2 room-1)
		(adj room-2 room-3)
		(adj room-3 room-2)

		(wide-door room-1 room-2)
		(wide-door room-2 room-1)		
		(wide-door room-2 room-3)
		(wide-door room-3 room-2)

		(in box room-1)

		(in ball-1 room-2)
		(in ball-2 room-3)
		(in ball-3 room-3)

		(in switch-1 room-1)
		(in switch-2 room-2)
		(in switch-3 room-3)
		(not (lights-on room-1))
		(not (lights-on room-2))
		(not (lights-on room-3))

		(in robot room-2)
		(empty gripper-1)
		(empty gripper-2)
	)

	(:goal (and (in ball-1 room-1) (in ball-2 room-1) (in ball-3 room-1) (in box room-1))
	)
				
)

; plan
1. (move robot room-2 room-1)
   deleted: (in robot room-2)
   added: (in robot room-1)
   goals met: 1 of 4
2. (move-box box robot room-1 room-2)
   deleted: (in robot room-1) (in box room-1)
   added: (in robot room-2) (in box room-2)
   goals met: 0 of 4
3. (turn-on-light box robot switch-2 room-2)
   added: (lights-on room-2)
   goals met: 0 of 4
4. (move-box box robot room-2 room-1)
   deleted: (in robot room-2) (in box room-2)
   added: (in robot room-1) (in box room-1)
   goals met: 1 of 4
5. (move robot room-1 room-2)
   deleted: (in robot room-1)
   added: (in robot room-2)
   goals met: 1 of 4
6. (pick-up robot gripper-1 room-2 ball-1)
   deleted: (in ball-1 room-2) (empty gripper-1)
   added: (holding gripper-1 ball-1)
   goals met: 1 of 4
7. (move robot room-2 room-1)
   deleted: (in robot room-2)
   added: (in robot room-1)
   goals met: 1 of 4
8. (drop robot gripper-1 room-1 ball-1)
   deleted: (holding gripper-1 ball-1)
   added: (in ball-1 room-1) (empty gripper-1)
   goals met: 2 of 4
9. (move-box box robot room-1 room-2)
   deleted: (in robot room-1) (in box room-1)
   added: (in robot room-2) (in box room-2)
   goals met: 1 of 4
10. (move-box box robot room-2 room-3)
   deleted: (in robot room-2) (in box room-2)
   added: (in robot room-3) (in box room-3)
   goals met: 1 of 4
11. (turn-on-light box robot switch-3 room-3)
   added: (lights-on room-3)
   goals met: 1 of 4
12. (move-box box robot room-3 room-2)
   deleted: (in robot room-3) (in box room-3)
   added: (in robot room-2) (in box room-2)
   goals met: 1 of 4
13. (move-box box robot room-2 room-1)
   deleted: (in robot room-2) (in box room-2)
   added: (in robot room-1) (in box room-1)
   goals met: 2 of 4
14. (move robot room-1 room-2)
   deleted: (in robot room-1)
   added: (in robot room-2)
   goals met: 2 of 4
15. (move robot room-2 room-3)
   deleted: (in robot room-2)
   added: (in robot room-3)
   goals met: 2 of 4
16. (pick-up robot gripper-1 room-3 ball-2)
   deleted: (in ball-2 room-3) (empty gripper-1)
   added: (holding gripper-1 ball-2)
   goals met: 2 of 4
17. (move robot room-3 room-2)
   deleted: (in robot room-3)
   added: (in robot room-2)
   goals met: 2 of 4
18. (move robot room-2 room-1)
   deleted: (in robot room-2)
   added: (in robot room-1)
   goals met: 2 of 4
19. (drop robot gripper-1 room-1 ball-2)
   deleted: (holding gripper-1 ball-2)
   added: (in ball-2 room-1) (empty gripper-1)
   goals met: 3 of 4
20. (move robot room-1 room-2)
   deleted: (in robot room-1)
   added: (in robot room-2)
   goals met: 3 of 4
21. (move robot room-2 room-3)
   deleted: (in robot room-2)
   added: (in robot room-3)
   goals met: 3 of 4
22. (pick-up robot gripper-1 room-3 ball-3)
   deleted: (in ball-3 room-3) (empty gripper-1)
   added: (holding gripper-1 ball-3)
   goals met: 3 of 4
23. (move robot room-3 room-2)
   deleted: (in robot room-3)
   added: (in robot room-2)
   goals met: 3 of 4
24. (move robot room-2 room-1)
   deleted: (in robot room-2)
   added: (in robot room-1)
   goals met: 3 of 4
25. (drop robot gripper-1 room-1 ball-3)
   deleted: (holding gripper-1 ball-3)
   added: (in ball-3 room-1) (empty gripper-1)
   goals met: 4 of 4
